import Link from "next/link";
import { useRouter } from "next/router";

import { useEffect, useState } from "react";

import DriverNavBar from "../../../components/DriverNavBar";

const chatHistory = {
  0: [
    {
      text: "Hello, teacher how are you today",
      type: "sender",
      tel: "1-083-241-8558"
    },
    {
      text: "I'm find I'm ok better than the yesterday",
      type: "receiver",
    },
  ],
  1: [
    {
      text: "ของมายังครับ",
      type: "sender",
      tel: "0863102395"
    },
  ],
  2: [
    {
      text: "ผมรักลุงตู่",
      type: "sender",
      tel: "0832418558"
    },
    {
      text: '... 💀',
      type: 'receiver'
    }
  ],
  3: [
    {
      text: "ขอบคุณครับ",
      type: "sender",
      tel: "0863102395"
    },
    {
      text: '👌',
      type: 'receiver'
    },
  ],
  4: [
    {
      text: "จะถึงประมาณกี่โมงคะ",
      type: "sender",
      tel: "0832418558"
    },
  ],
};

const chatData = [
  { name: "อธิชา เล็กสรรเสริญ", id: "0" },
  { name: "พิขานนท์ ทวีพิยทนันท์", id: "1" },
  { name: "อุษณีย์​ โกมาศ", id: "2" },
  { name: "โมกข์ มาอาจ", id: "3" },
  { name: "พิรดา เธียรเจริญสุข", id: "4" },
];

function SenderCard(props) {
  console.log(props.text);

  return (
    <div className="text-black flex m-5 w-full overflow-clip">
      <div className="mr-4">
        <svg
          width="46"
          height="45"
          viewBox="0 0 46 45"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <circle cx="22.7514" cy="22.5" r="22.5" fill="#D9D9D9" />
          <path
            d="M23.037 3.00028C22.4626 3.00028 21.8953 3.08584 21.3521 3.22189C21.0344 3.30242 20.7281 3.40818 20.4217 3.53213C20.304 3.58037 20.1836 3.61062 20.0674 3.66509C20.0192 3.68755 19.9823 3.73025 19.9345 3.75374C19.6463 3.89639 19.3643 4.06156 19.0925 4.24127C19.0542 4.26594 18.9973 4.26026 18.9595 4.28559C18.8796 4.34039 18.8162 4.40499 18.7379 4.4628C18.5154 4.6225 18.2818 4.76915 18.0731 4.9504C17.8827 5.12159 17.7193 5.33674 17.5412 5.5265C16.9383 6.14473 16.4157 6.79883 15.9899 7.56541C15.2589 8.84667 14.7132 10.2892 14.4831 11.7758C14.3721 11.7524 14.2703 11.7441 14.1728 11.7758C13.4281 12.0183 13.2446 13.4331 13.7296 14.9225C14.0143 15.7966 14.4878 16.4848 14.9706 16.8727C15.6192 19.3941 16.9926 21.4959 18.7822 22.8121V24.2743L17.3639 25.6926L14.5274 27.1109C12.2336 28.2469 9.94865 29.3872 7.65758 30.5232C6.38804 31.2891 5.89679 32.7924 6.01777 34.2022C6.07686 35.09 5.75613 36.2261 6.63827 36.8175C7.47632 37.2486 8.4762 36.9678 9.38616 37.0387C12.0477 37.0373 14.7024 37.0387 17.3639 37.0387C21.1493 37.0402 24.9247 37.0387 28.7101 37.0387C32.0671 37.0387 35.4142 37.0444 38.7713 37.0387C39.8605 36.9622 40.1626 35.8119 40.0562 34.9113C40.0761 33.5895 40.1541 32.1088 39.1259 31.099C38.2862 30.2452 37.0921 29.9077 36.0681 29.3262C34.5633 28.5816 33.05 27.8554 31.5466 27.1109L28.7101 25.6926L27.2918 24.2743V22.8121C29.0817 21.4959 30.4546 19.3941 31.1041 16.8727C31.5863 16.4846 32.06 15.7965 32.3437 14.9225C32.8287 13.4331 32.6458 12.0183 31.9012 11.7758C31.8033 11.7441 31.7026 11.7524 31.5906 11.7758C31.3608 10.2892 30.8148 8.84667 30.0844 7.56541C29.6589 6.79883 29.1356 6.14473 28.5328 5.5265C28.3541 5.33674 28.191 5.12159 28.0009 4.9504C27.9924 4.9426 27.9655 4.9582 27.957 4.9504C27.401 4.45415 26.7841 4.07258 26.1402 3.75374C25.9771 3.674 25.8182 3.5998 25.6523 3.53213C25.5332 3.4839 25.4183 3.44099 25.2977 3.39917C24.9361 3.27368 24.5659 3.15301 24.1886 3.08892C24.1603 3.08409 24.1291 3.09339 24.1007 3.08892C23.7476 3.03341 23.3987 2.99638 23.037 3.00028Z"
            fill="#34495E"
          />
          <path
            d="M6.01778 35.6205C6.05525 36.046 6.1972 36.4714 6.63827 36.7551C7.47632 37.1805 8.4762 36.897 9.38617 37.0388H17.3639H28.7101H38.7713C39.5882 36.897 39.9655 36.3297 40.0562 35.6205H6.01778Z"
            fill="#2C3E50"
          />
        </svg>
      </div>
      <div className="p-3 text-xl bg-black text-white rounded-xl max-w-[70%]">
        <p className="underline w-full">{props.sender}</p>
        <p className="mt-4 block">{props.text}</p>
      </div>
    </div>
  );
}

function ReceiverCard(props) {
  console.log(props.text);

  return (
    <div className="text-black flex m-5 w-full">
      <div className="p-3 text-xl bg-black text-white rounded-xl max-w-[80%] m-auto mr-12 text-right">
        <p className="underline w-full">คุณ</p>
        <p className="mt-4 block">{props.text}</p>
      </div>
    </div>
  );
}

export default function DriverMessage() {
  const router = useRouter();
  const { channelId } = router.query;
  const [id, setId] = useState();

  useEffect(() => {
    if (channelId) setId(channelId);
  }, [channelId]);

  if (id) {
    const channelMessages = chatHistory[id];
    const name = chatData.find((e) => e.id == id)["name"];
    const tel = chatData.find(e => e.id == id)["tel"]
    return (
      <div className="h-screen w-screen bg-white">
        {/* header */}
        {/* return */}
        <div className="bg-primaryMain h-[8%] w-full flex  items-center text-xl">
          <Link href="/driver/contact" className="flex ml-4">
            <svg
              className="my-auto mr-4"
              width="40"
              height="44"
              viewBox="0 0 40 44"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M22.235 35.9734V44C31.727 44 39.4488 36.278 39.4488 26.786C39.4488 17.2945 31.727 9.57252 22.235 9.57252H15.9157L19.8122 5.67601L14.1368 0L0.551041 13.5856L14.1366 27.1708L19.812 21.4952L15.9157 17.5989H22.235C27.301 17.5989 31.4222 21.7202 31.4222 26.786C31.4222 31.8515 27.301 35.9734 22.235 35.9734Z"
                fill="white"
              />
            </svg>
          </Link>

          {/* Name */}
          <p className="mx-auto">{name}</p>

          {/* Phone Icons */}
          <a href={`tel:${tel}`}>
            <svg width="54" height="54" viewBox="0 0 54 54" fill="white" xmlns="http://www.w3.org/2000/svg"
              className="mr-5 w-10 my-auto">
              <g clip-path="url(#clip0_78_2)">
                <path d="M53.364 40.908C51.356 37.112 44.383 32.996 44.076 32.816C43.18 32.306 42.245 32.036 41.37 32.036C40.069 32.036 39.004 32.632 38.359 33.716C37.339 34.936 36.074 36.362 35.767 36.583C33.391 38.195 31.531 38.012 29.473 35.954L17.987 24.467C15.942 22.422 15.754 20.539 17.355 18.176C17.579 17.867 19.005 16.601 20.225 15.58C21.003 15.117 21.537 14.429 21.771 13.585C22.082 12.462 21.853 11.141 21.119 9.854C20.946 9.558 16.828 2.584 13.034 0.576998C12.326 0.201998 11.528 0.0039978 10.728 0.0039978C9.41003 0.0039978 8.17003 0.517998 7.23803 1.449L4.70003 3.986C0.686029 7.999 -0.766971 12.548 0.379029 17.506C1.33503 21.638 4.12103 26.035 8.66103 30.574L23.366 45.279C29.112 51.025 34.59 53.939 39.648 53.939C39.648 53.939 39.648 53.939 39.649 53.939C43.369 53.939 46.837 52.358 49.954 49.241L52.491 46.704C54.033 45.163 54.383 42.833 53.364 40.908Z" />
              </g>
              <defs>
                <clipPath id="clip0_78_2">
                  <rect width="53.942" height="53.942" fill="white" />
                </clipPath>
              </defs>
            </svg>
          </a>

        </div>

        <div className="w-full overflow-clip">
          {channelMessages.map((e, idx) => {
            if (idx >= chatData.length) return;

            if (e.type == "sender")
              return <SenderCard text={e.text} sender={name} />;
            return <ReceiverCard text={e.text} key={e.text} />;
          })}
        </div>

        <div className="absolute bottom-28 right-1/2 left-1/2">
          <div className="flex justify-center ">
            <div className="bg-messege_box w-16 h-16 rounded-md pt-2">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                height="48"
                width="48"
                className="m-auto"
              >
                <path d="M24 34.7q3.6 0 6.05-2.45 2.45-2.45 2.45-6.1 0-3.6-2.45-6.025Q27.6 17.7 24 17.7q-3.65 0-6.075 2.425Q15.5 22.55 15.5 26.15q0 3.65 2.425 6.1Q20.35 34.7 24 34.7Zm0-3q-2.4 0-3.95-1.575-1.55-1.575-1.55-3.975 0-2.35 1.55-3.9Q21.6 20.7 24 20.7q2.35 0 3.925 1.55 1.575 1.55 1.575 3.9 0 2.4-1.575 3.975Q26.35 31.7 24 31.7ZM7 42q-1.2 0-2.1-.9Q4 40.2 4 39V13.35q0-1.15.9-2.075.9-.925 2.1-.925h7.35L18 6h12l3.65 4.35H41q1.15 0 2.075.925Q44 12.2 44 13.35V39q0 1.2-.925 2.1-.925.9-2.075.9Zm34-3V13.35h-8.75L28.6 9h-9.2l-3.65 4.35H7V39ZM24 26.2Z" />
              </svg>
            </div>

            <div className=" h-16 bg-messege_box rounded-md mx-4">
              <form>
                <input
                  type="text"
                  className="bg-messege_box w-60 px-4 h-16 rounded-md text-black"
                  placeholder="type something"
                ></input>
              </form>
            </div>

            <div className="bg-messege_box w-16 h-16 rounded-md pt-4">
              <svg
                width="40"
                height="32"
                viewBox="0 0 40 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="m-auto"
              >
                <path
                  d="M39.4038 0.345005C39.3988 0.342341 39.3972 0.338376 39.3938 0.335774C39.3839 0.329145 39.3739 0.327844 39.3639 0.321215C39.2756 0.260439 39.1708 0.220788 39.0676 0.177173C39.0343 0.163977 39.0093 0.141488 38.9744 0.129593C38.9694 0.128292 38.966 0.128292 38.9628 0.126929C38.9262 0.115034 38.8962 0.0939076 38.8595 0.0833136C38.7214 0.0423623 38.5749 0.0291042 38.4267 0.0185722C38.3818 0.0159082 38.3385 4.80605e-05 38.2935 4.80605e-05C38.1004 -0.00125296 37.9057 0.0238382 37.7159 0.0780475L1.09668 10.6514C0.515786 10.8192 0.0996057 11.229 0.0147156 11.7153C-0.0668195 12.2017 0.194483 12.6841 0.69883 12.9696L11.7695 19.2489L13.3325 27.9415C13.429 28.4702 13.9167 28.901 14.5692 29.0346C14.7057 29.0623 14.8455 29.0755 14.9821 29.0755C15.4964 29.0755 15.9941 28.8852 16.312 28.5469L20.2403 24.3902L30.5419 31.4056C30.8499 31.6145 31.2344 31.7241 31.6272 31.7241C31.8136 31.7241 32 31.699 32.1831 31.6488C32.7424 31.4902 33.1568 31.1056 33.2633 30.6404L39.973 1.58866C40.0829 1.11286 39.8499 0.644984 39.4038 0.345005ZM18.7356 21.5658L18.6157 21.7033L16.0607 24.4087L15.0936 19.0295L29.5365 9.08918L18.7356 21.5658Z"
                  fill="black"
                />
              </svg>
            </div>
          </div>
        </div>

        <DriverNavBar className="absolute w-full bottom-0 z-10" />
      </div>
    );
  }

  return <div>Loading...</div>;
}
